#pragma once
#ifndef MENU_H_
#define MENU_H_
#include<stdio.h>
#include<stdlib.h>
void menu(int flag)
{
  // system("clear");
    int i=0;
    char map[18][100]=
    {     " \033[34m      欢迎来到企业员工管理系统      \n",
          "                                                 \n",
          "                                                  \n",
               "    \033[31m     1.输入员工信息              \n",
               "    \033[34m     2.员工信息的修改            \n",
               "    \033[33m     3.删除员工信息              \n",
               "    \033[35m     4.查询员工信息              \n",
               "    \033[31m     5.显示所有员工信息          \n",
               "    \033[34m     6.保存员工信息              \n",
               "    \033[33m     7.读取员工信息              \n",
               "    \033[35m     8.增加员工信息              \n",
               "    \033[31m     9.统计员工信息              \n",
               "    \033[34m     10.员工信息排序(根据工资排序)             \n",
               "    \033[33m     11.考勤管理(请假,加班,出勤) \n",
               "    \033[35m     12.数据报表                 \n",
               "    \033[31m     13.业绩评定管理(根据出勤计算)             \n",
               "    \033[34m     14.退出此程序                \033[37m  \n",
               "                                             \n",
   };
    for(i=0;i<18;i++)
    {
        if(flag==i+1)
            printf("-->");//如果相等箭头输出
        else
            printf("  ");//不然输出空格
        printf("%s",map[i]);
    }
}
#endif
